tests/data/payment_success.xml

<document><bank name="Kazkommertsbank JSC"><customer name="TSET TEST" mail="abdu.galymzhan@gmail.com" phone=""><merchant cert_id="00C182B189" name="Test shop"><order order_id="400124" amount="1000" currency="398"><department merchant_id="92061101" amount="1000"/></order></merchant><merchant_sign type="RSA"/></customer><customer_sign type="RSA"/><results timestamp="2017-11-24 19:08:56"><payment merchant_id="92061101" card="440564-XX-XXXX-6150" amount="1000" reference="171124190855" approval_code="190855" response_code="00" Secure="No" card_bin="" c_hash="13988BBF7C6649F799F36A4808490A3E"/></results></bank><bank_sign cert_id="00c183d690" type="SHA/RSA">aoKHolBaRXOl4TZ12AlsjwgwOLD4RZFs3ajE6FD0f8XFP5Got9htJNYW6hYgqLTOPz74m6B3PEsnDBae6WzZDGD3HXACuv1LIJH/KelCMdzEUhB+Vs5+LqZVxbXdceESLUb1CeQb8hDp9AxZvWVeSE/eSMgWkw7fudT4J56xGmA=</bank_sign></document>